# İleri Birleşirme İşlemleri

In [1]:
import pandas as pd

In [2]:
#birebir birlestirme

In [3]:
df1 = pd.DataFrame({'calisanlar' : ["Ali","Veli","Ayse","Fatma"],
                    'grup': ["Muhasebe","Muhendislik","Muhendislik","İK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [5]:
df2 = pd.DataFrame({'calisanlar' : ["Ali","Veli","Ayse","Fatma"],
                    'ilk_giris' : [2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [6]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           İK       2019

**Merge** ile iki farklı DataFrame'i birebir birleştirme işlemi yapıyoruz.Merge birleştirm işleminin hangi argümanlara göre yapılacağını kendisi otomatik 
olarak algılıyor.

In [7]:
#coktan teke birlestirme (many to one)

In [8]:
df3=pd.merge(df1,df2)

In [9]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           İK       2019

In [10]:
df4=pd.DataFrame({'grup':["Muhasebe","Muhendislik","İK"],
                  'mudur':["Caner","Mustafa","Be"]})

In [11]:
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [12]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           İK       2019  Berkcan

In [13]:
#coktan coka (many to many)

In [15]:
df5 = pd.DataFrame({'grup' : ["Muhasebe","Muhasebe","Muhendislik","Muhendislik","İnsanKaynakları","İnsanKaynakaları"],
                    'yetenekler': ["matematik","excel","kodlama","linux","excel","yonetim"]})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [16]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [17]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim